# GetLinkHeightToLayerDeltaZ

## Description
_Vectorworks 2012 Deprecated Functions_. See architectural category for replacement:
:DelObjStoryBound
:DelObjStoryBounds
:GetObjBoundElevation
:GetObjStoryBound
:GetObjStoryBoundsAt
:GetObjStoryBoundsCnt
:GetStoryLayerInfo
:HasObjStoryBound
:HasObjStoryBounds
:SetObjectStoryBound

Returns whether or not the wall's height is linked to the layer delta z.

```pascal
FUNCTION GetLinkHeightToLayerDeltaZ(theWall : HANDLE): BOOLEAN;
```

```python
def vs.GetLinkHeightToLayerDeltaZ(theWall):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|theWall|HANDLE|The wall.|

## Examples
```pascal
resultOK := GetLinkHeightToLayerDeltaZ(theWall);
```
```python
import vs

# _Vectorworks 2012 Deprecated Functions_.
theWall = vs.FSActLayer()  # handle to the first selected object on the active layer

ok = vs.GetLinkHeightToLayerDeltaZ(theWall)
if ok:
    vs.Message('GetLinkHeightToLayerDeltaZ succeeded')
else:
    vs.Message('GetLinkHeightToLayerDeltaZ failed')
```

## See Also
VS Functions:
SetLinkHeightToLayerDeltaZ

## Version
Availability: from VectorWorks12.5
Deprecated: Vectorworks 2012 Deprecated Functions

## Category
* Objects - Walls